# 1. Реализовать вывод информации о промежутке времени в зависимости от
# его продолжительности duration в секундах:
# a. до минуты: <s> сек;
# b. до часа: <m> мин <s> сек;
# c. до суток: <h> час <m> мин <s> сек;
# d. * в остальных случаях: <d> дн <h> час <m> мин <s> сек

duration = int(input("Введите промежуток времени в секундах: "))
if duration // 60 < 1:
    print(duration, "сек")
elif 0 < duration // 60 < 60:
    m = duration // 60
    s = duration % 60
    print(m, "мин", s, "сек")
elif 0 < duration // (60 * 60) < 24:
    h = duration // (60 * 60)
    m = duration % (60 * 60) // 60
    s = m % 60
    print(h, "час", m, "мин", s, "сек")
else:
    d = duration // (60 * 60 * 24)
    h = (duration % (60 * 60 * 24)) // (60 * 60)
    m = (duration % (60 * 60 * 24)) % (60 * 60) // 60
    s = (((duration % (60 * 60 * 24)) % (60 * 60)) // 60) % 60
    print(d, "день", h, "час", m, "мин", s, "сек")
